graph = {

    # Line 1
    "Комсомольская (1)": [(6, "Комсомольская (5)"), (3, "Красные Ворота (1)")],
    "Красные Ворота (1)": [(3, "Комсомольская (1)"), (3, "Чистые пруды (1)")],
    "Чистые пруды (1)": [(3, "Красные Ворота (1)"), (3, "Лубянка (1)")],
    "Лубянка (1)": [(3, "Чистые пруды (1)"), (3, "Охотный Ряд (1)")],
    "Охотный Ряд (1)": [(3, "Лубянка (1)"), (4, "Театральная (2)"), (3, "Библиотека имени Ленина (1)")],
    "Библиотека имени Ленина (1)":[(3, "Охотный Ряд (1)"), (5, "Арбатская (3)"), (3, "Кропоткинская (1)")],
    "Кропоткинская (1)": [(3, "Библиотека имени Ленина (1)"), (3, "Парк культуры (1)")],
    "Парк культуры (1)": [(3, "Кропоткинская (1)"), (5, "Парк культуры (5)")],

    # Line 2
    "Павелецкая (2)": [(4, "Павелецкая (5)"), (3, "Новокузнецкая (2)")],
    "Новокузнецкая (2)": [(3, "Павелецкая (2)"),  (4, "Театральная (2)")],
    "Театральная (2)": [(4, "Новокузнецкая (2)"), (4, "Охотный Ряд (1)"), (5, "Площадь Революции (3)"), (3, "Тверская (2)")],
    "Тверская (2)": [(3, "Театральная (2)"), (3, "Маяковская (2)")],
    "Маяковская (2)": [(3, "Тверская (2)"), (3, "Белорусская (2)")],
    "Белорусская (2)": [(3, "Маяковская (2)"), (3, "Белорусская (5)")],

    # Line 3
    "Курская (3)": [(4, "Курская (5)"), (4, "Площадь Революции (3)")],
    "Площадь Революции (3)": [(4, "Курская (3)"), (5, "Театральная (2)"), (3, "Арбатская (3)")],
    "Арбатская (3)": [(3, "Площадь Революции (3)"), (5, "Библиотека имени Ленина (1)"), (5, "Киевская (3)")],
    "Киевская (3)": [(5, "Арбатская (3)"), (3, "Киевская (5)")],

    # Line 5
    "Комсомольская (5)": [(4, "Проспект Мира (5)"), (6, "Комсомольская (1)"), (4, "Курская (5)")],
    "Курская (5)": [(4, "Комсомольская (5)"), (4, "Курская (3)"), (4, "Таганская (5)")],
    "Таганская (5)": [(4, "Курская (5)"), (3, "Павелецкая (5)")],
    "Павелецкая (5)": [(3, "Таганская (5)"), (4, "Павелецкая (2)"), (3, "Добрынинская (5)")],
    "Добрынинская (5)": [(3, "Павелецкая (5)"), (3, "Октябрьская (5)")],
    "Октябрьская (5)": [(3, "Добрынинская (5)"), (3, "Парк культуры (5)")],
    "Парк культуры (5)": [(3, "Октябрьская (5)"), (5, "Парк культуры (1)"), (4, "Киевская (5)")],
    "Киевская (5)": [(4, "Парк культуры (5)"), (3, "Киевская (3)"), (4, "Краснопресненская (5)")],
    "Краснопресненская (5)": [(4, "Киевская (5)"), (4, "Белорусская (5)")],
    "Белорусская (5)": [(4, "Краснопресненская (5)"), (3, "Белорусская (2)"), (3, "Новослободская (5)")],
    "Новослободская (5)": [(3, "Белорусская (5)"), (4, "Проспект Мира (5)")],
    "Проспект Мира (5)": [(4, "Новослободская (5)"), (4, "Комсомольская (5)")],

}